# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [3]:
# your answer here
employee = pd.read_csv("data/Employee.csv")
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [7]:
# Method 1
# your answer here
display(employee.groupby("Department").agg({"Salary": np.mean}))

employee.pivot_table(index = "Department", values = "Salary", aggfunc = "mean")

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [9]:
# Method 2
# your answer here
employee.pivot_table(index = ["Department", "Title"], values = "Salary", aggfunc = "mean").reset_index()

  Department      Title  Salary
0         HR         VP    70.0
1         HR    analyst    32.5
2         IT         VP    70.0
3         IT    analyst    32.5
4         IT  associate    60.0
5      Sales  associate    55.0

In [ ]:
# your answer here

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [14]:
# your answer here

employee.pivot_table(index = "Title", values = ["Salary", "Years"], aggfunc = "sum").reset_index()

       Title  Salary  Years
0         VP     140     16
1    analyst     130      9
2  associate     170     12

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [22]:
# your answer here

# Used below code to verify total employees.
# display(employee.groupby(["Department", "Title"]).value_counts())


df = employee.groupby(["Department", "Title"]).agg({"Salary": "mean", "Name": "count"}).reset_index()
df.columns = ["Department", "Title", "Salary", "Total Employees"]
df

  Department      Title  Salary  Total Employees
0         HR         VP    70.0                1
1         HR    analyst    32.5                2
2         IT         VP    70.0                1
3         IT    analyst    32.5                2
4         IT  associate    60.0                1
5      Sales  associate    55.0                2

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [30]:
# your answer here
df2 = employee.groupby(["Department", "Title"]).agg({"Salary" : [min, max, "median", "std"]}).reset_index()
df2.columns = ["Department", "Title", "Min Salary", "Max Salary", "Median Salary", "Std deviation Salary"]
df2

,Department,Title,Min Salary,Max Salary,Median Salary,Std deviation Salary
0,HR,VP,70,70,70.0,NaN
1,HR,analyst,30,35,32.5,3.535534
2,IT,VP,70,70,70.0,NaN
3,IT,analyst,30,35,32.5,3.535534
4,IT,associate,60,60,60.0,NaN
5,Sales,associate,55,55,55.0,0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [35]:
# your answer here
df2["Std deviation Salary"].isna().sum() # 3
df2["Std deviation Salary"] = df2["Std deviation Salary"].fillna(0)
df2

,Department,Title,Min Salary,Max Salary,Median Salary,Std deviation Salary
0,HR,VP,70,70,70.0,0.000000
1,HR,analyst,30,35,32.5,3.535534
2,IT,VP,70,70,70.0,0.000000
3,IT,analyst,30,35,32.5,3.535534
4,IT,associate,60,60,60.0,0.000000
5,Sales,associate,55,55,55.0,0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [42]:
# your answer here
df3 = employee.groupby("Department").agg({"Name" : "count", "Salary": "sum"})
df3.columns = ["Total employees", "Salary"]
df3 = df3.reset_index()
df3

  Department  Total employees  Salary
0         HR                3     135
1         IT                4     195
2      Sales                2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [44]:
# your answer here
employee.groupby(["Department", "Title"]).agg({ "Years" : "sum", "Salary": "mean"}).reset_index()

  Department      Title  Years  Salary
0         HR         VP      8    70.0
1         HR    analyst      6    32.5
2         IT         VP      8    70.0
3         IT    analyst      3    32.5
4         IT  associate      7    60.0
5      Sales  associate      5    55.0

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [51]:
def remove_max_avg(x):
    
    # Removing maximum number and then calculating average.
    return (sum(x)-max(x))/(len(x)-1)

remove_max_avg([1,2,3,8])

2.0

In [52]:
employee.groupby("Department").agg(remove_max_avg)

/var/folders/yl/blp7v0ys1lzdfkls51wcv3l40000gn/T/ipykernel_52255/2823126654.py:1: FutureWarning: ['Name', 'Education', 'Gender', 'Title'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  employee.groupby("Department").agg(remove_max_avg)

               Years     Salary
Department
HR          3.000000  32.500000
IT          3.333333  41.666667
Sales       2.000000  55.000000

In [54]:
employee.groupby("Department").agg({"Salary": "mean"})

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00